#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

// & - 按（2进制）位与
//| - 按（2进制）位或
// ^ - 按（2进制）位异或 - 相同为0，相异以1


//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	//00000000000000000000000000000011   3的原，反，补码
//	// 
//	//10000000000000000000000000000101  -5的原码
//	//11111111111111111111111111111010  -5的反码
//	//11111111111111111111111111111011  -5的补码
//	// 
//	//11111111111111111111111111111011  -5的补码
//	//00000000000000000000000000000011   3的补码
//	//00000000000000000000000000000011  3&-5补码
//	// 第一个数字为0，结果为真，所以原码、反码、补码相同
//	//00000000000000000000000000000011  3&-5原码、反码、补码
//	// ---->>>>c=3
//	//%d 意味着打印一个有符号的整数
//	//
//	printf("c=%d\n", c);//
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;
//	//00000000000000000000000000000011   3的补码
//	// 
//	//10000000000000000000000000000101  -5的原码
//	//11111111111111111111111111111010  -5的反码
//	//11111111111111111111111111111011  -5的补码
//	// 
//	//11111111111111111111111111111011  -5的补码
//	//00000000000000000000000000000011   3的补码
//	//11111111111111111111111111111011   3|-5的补码，只要有1，则为真（1）
//	// 第一个数字为1，为负数
//	//11111111111111111111111111111010	 3|-5的补码-1得反码
//	//10000000000000000000000000000101	 3|-5的原码
//	//--->>>c=-5
//	//%d 意味着打印一个有符号的整数
//	//
//	printf("c=%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	00000000000000000000000000000011   3的补码
//	 
//	10000000000000000000000000000101  -5的原码
//	11111111111111111111111111111010  -5的反码
//	11111111111111111111111111111011  -5的补码
//	 
//	11111111111111111111111111111011  -5的补码
//	00000000000000000000000000000011   3的补码
//	11111111111111111111111111111000  3^-5的补码
//	 第一个数字是0，为负数
//	11111111111111111111111111110111  3^-5的反码
//	10000000000000000000000000001000  3^-5的原码
//	----》》》》c=-8
//	%d 意味着打印一个有符号的整数
//	
//	printf("c=%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;//空瓶
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//  //这种方法会有溢出的问题
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}
//

// int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a ^ b;//a=3^5
//	b = a ^ b;//3^5^5 --> b=3
//	a = a ^ b;//3^5^3 --> a=5
//
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	a |= (1 << 4);
//	printf("%d\n", a);//a=29
//
//	//在指定位置（二进制）加1
//	//00000000000000000000000000001101  13的原码，反码，补码
//	//00000000000000000000000000010000        //1<<4相当于1向左移动四位
//	//00000000000000000000000000011101  两者按位或|可以得到在指定的位置上加1
//	// ————>>>>>>>a=29;
//	//从上面我们不难总结出：想在二进制某个位置上加1，可以与（1向左移动n-1位）进行按位或|
//
//
//	a &= (~(1 << 4));
//	printf("%d\n", a);//a=13
//	//在指定位置（二进制）减1
//	//00000000000000000000000000011101   29的原码，反码，补码
//	//11111111111111111111111111101111   取反~(1<<4)
//	//00000000000000000000000000001101   两者按位与&可以得到在指定位置减1
//	// ----->>>>>a=13;
//	// 
//	//11111111111111111111111111101111   取反~(1<<4)
//	//00000000000000000000000000010000   1<<4相当于1向左移动四位
//	//
//	
//	return 0;
//}

//#include <stdio.h>
//void test1(int arr[])
//{
////	printf("%d\n", sizeof(arr));//(2)
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}
//
//void test(int n)
//{
//	printf("%d ", n);
//}
//int main()
//{
//	int a1 = 3;
//	int b1= ++a1;//前置++，先++，后使用
//	等价于a=a+1,b=a;
//	int b2 = a1++;//后置++，先使用，再++
//	等价于b=a, a=a+1
//	printf("%d\n", a1);
//	printf("%d\n", b1);
//	printf("%d\n", b2);
//
//	int a2 = 3;
//	int b3 = a2--;
//	等价于b3=a2,a2=a2-1
//	int b3 = --a2;//前置--，先--，后使用
//	等价于a2=a2-1,b3=a2
//	printf("%d\n", a2);//2
//	printf("%d\n", b3);//3
//
//	int a3 = 10;
//	printf("%d\n", a3--);//?
//	printf("%d\n", a3);//?
//
//	int a = 10;
//	test(a--);
//
//	return 0;
//}
//
//
int main()
{
	int a = 10;
	int* p = &a;
	*p = 20;
	printf("%d\n", a);

	return 0;
}

//int main()
//{
//	time_t;//long long
//	srand((unsigned int)time(NULL));//强制类型转换
//	int a = (int)3.14;//将浮点数3.14强制转换为整形
//	printf("%d\n", a);
//	return 0;
//}